[
    {
        "id": "ELL700",
        "name": "Linear Systems Theory ",
        "credit": "(3-0-0)",
        "description": "Review of matrix algebra, state variable modelling of continuous and discrete time systems, linearization of state equations, solution of state equations of linear time-invariant and timevarying systems, Controllability and observability of dynamical systems, Minimal realization of linear systems and canonical forms, Lyapunov's stability theory for linear dynamical systems, State Feedback controllers, Observer and Controller design."
    },
    {
        "id": "ELL701",
        "name": "Mathematical Methods in Control ",
        "credit": "(3-0-0)",
        "description": "Linear Spaces - Vectors and Matrices, Transformations, Norms - Vector and Matrix norms, Matrix factorization, Eigenvalues and Eigenvectors and Applications, Singular Value Decomposition and its Applications, Projections, Least Square Solutions. Probability, Random Variables, Probability distribution and density functions, Joint density and Conditional distribution, Functions of random variables, Moments, characteristic functions, sequence of random variables, Correlation matrices and their properties, Random processes and their properties, Response of Linear systems to stochastic inputs, PSD theorem."
    },
    {
        "id": "ELL702",
        "name": "Nonlinear Systems ",
        "credit": "(3-0-0)",
        "description": "Introduction to nonlinear systems: Examples of phenomena, models & derivation of system equations. Fundamental properties: Existence & uniqueness, Dependence on initial conditions & parameters. Phase plane analysis. Limit cycles & oscillations. Describing function method and applications. Circle criterion. Lyapunov stability of autonomous systems. Perturbation theory & Averaging. Singular perturbation model and stability analysis. Basic results on Lie algebra. Controllability and Observability of nonlinear systems. Bifurcations. Chaos. Synchronization."
    },
    {
        "id": "ELL703",
        "name": "Optimal Control Theory",
        "credit": "(3-0-0)",
        "description": "Maximization of functionals of a single and several functions using calculus of variations, Constrained extremals, Euler-Lagrange Equation, Necessary conditions for optimal control, Pontryagin's minimum principle and state inequality constraints, Minimum time problems, Minimum control effort problems, Linear quadratic regulator problems, Riccati Equation, Singular intervals in optimal control problems, The principle of optimality, Application of the principle of optimality to decision making, Dynamic programming applied to routing problems, Solving optimal control problems using dynamic programming, Discrete linear regulator problem, Hamilton -Jacobi -Bellman Equation, Numerical Techniques to determine optimal trajectories."
    },
    {
        "id": "ELL705",
        "name": "Stochastic Filtering and Identification ",
        "credit": "(3-0-0)",
        "description": "MMSE estimation including LMS, Gaussian case. Wiener filtering & prediction. Kalman filtering & prediction. Extended Kalman filtering. Predictors for difference equation based models including ARMA, Box Jenkins & others. Statistical properties of Least Squares estimation and its relationship with Bayes estimation (ML, MAP), convergence analysis, CR bound. Recursive Least Squares, Iterative methods for nonlinear Least Squares. Identification problem: Different approaches for linear dynamical systems. Offline identification methods including Least Squares, Prediction error framework, Pseudo-linear regression (PLR) & Instrument variable methods. Recursive Identification of linear dynamical system: RLS, PLR, Prediction error framework & its application to ARMA & Innovations representation. Convergence Analysis of Recursive Identification methods: Associated ODE, Martingale. Nonlinear system identification. Subspace based method of system identification. Applications including LQG and adaptive control."
    },
    {
        "id": "ELL704",
        "name": "Advanced Robotics ",
        "credit": "(3-0-0)",
        "description": "Review of Coordinate Transformations, D-H parameters and kinematics. Velocity kinematics and Jacobian, Singularity analysis, Robot Dynamics. Motion planning, Robot control: linear methods - feedforward control, state feedback, observers; Nonlinear Control methods - Computed Torque Control, Feedback linearization, Sliding Mode control; Vision based Robotic Control. Holonomic and Non-Holonomic Systems, Mobile Robots: Modeling and Control, Odometry Analysis, Navigation problems with obstacle avoidance, motion capturing systems."
    },
    {
        "id": "ELL707",
        "name": "Systems Biology",
        "credit": "(3-0-0)",
        "description": "MODELS : Variables and parameters, Law of mass action, Representations : Deterministic vs stochastic, Spatial aspects, Examples of core processes: Gene expression, Protein degradation, Phosphorylation.DYNAMICS : Equilibrium solutions, Bifurcations, Switches, Bistability, Pulses and Oscillations, Circadian Rhythms and Clocks, Spatial patterns. Morphogenesis and Development.CONTROL MECHANISMS : Performance Goals, Integral Feedback Control, Homeostasis and Perfect Adaptation, Bacterial Chemotaxis, Feedforward Loops, Fold Change Detection, Robustness to Perturbations, Tradeoffs, Internal Model Principle."
    },
    {
        "id": "ELL708",
        "name": "Selected Topics in Systems and Control ",
        "credit": "(3-0-0)",
        "description": "To be decided by the Instructor when floating this course: It can be anything that is related to systems and control engineering, but is not covered in any of the established courses."
    },
    {
        "id": "ELL709",
        "name": "Design Aspects in Control ",
        "credit": "(3-0-0)",
        "description": "System Modeling - model structures (Process model, ARX model), Review of concepts of stability, feedback and feedforward control. Classical control - First-Order Plus Dead-Time model (FOPDT), process reaction curves, Second-Order Plus Dead-Time model (SOPDT), relay feedback process identification; Smith Predictor and its variations, PID controllers and their tuning, Ziegler-Nichols and Cohen-Coon techniques. Reliable State Feedback design - pole placement, eigenstructure assignment, region based eigenvalue assignment, eigenstructure-time response relationships. Controller gain selection - noise sensitivity. Controller robustness. Disturbance rejection. Frequency Domain Loop Shaping. Output feedback control - compensator design, review of Lead, Lag and Lag-Lead compensators, Zero dynamics - significance in servo control design, design for unstable zero dynamics. Observers - concept and design philosophy. Applications in practical controller design scenarios."
    },
    {
        "id": "ELL800",
        "name": "Numerical Linear Algebra and Optimization in Engineering",
        "credit": "(3-0-0)",
        "description": "Basics of Linear Algebra; Matrix decomposition - LU, LDU, QR and Cholesky factorization; Householder reflection, Givens rotation; Numerical implications of SVD; Numerical Solution for Linear Systems; Algorithm Stability; Problem Conditioning; Pivoting and scaling; Least Square Solutions; Numerical Matrix eigenvalue methods; Sparse Systems; Iterative methods for large systems; Krylov, Arnoldi, Lanczos methods; Numerical Optimization techniques - Conjugate gradient method, Linear and quadratic programming, Spectral and Pseudo-spectral methods."
    },
    {
        "id": "ELL801 ",
        "name": "Nonlinear Control ",
        "credit": "(3-0-0)",
        "description": "Overview of nonlinear control, Lyapunov stability for autonomous and non-autonomous systems, Input-Output Stability and Input-to- State Stability, Passivity analysis and applications, Absolute Stability, Incremental stability analysis, Lyapunov-based feedback control design, Feedback linearization and backstepping, Sliding mode control, Nonlinear observer design."
    },
    {
        "id": "ELL802",
        "name": "Adaptive and Learning Control",
        "credit": "(3-0-0)",
        "description": "ntroduction to adaptive control, Review of Lyapunov stability theory, Direct and indirect adaptive control, Model reference adaptive control, Parameter convergence, persistence of excitation, Adaptive backstepping, Adaptive control of nonlinear systems, Composite adaptation, Neural Network-based control, Repetitive learning control, Reinforcement learning-based control, Predictive control, Robust adaptive control."
    },
    {
        "id": "ELL803",
        "name": "Model Reduction in Control ",
        "credit": "(3-0-0)",
        "description": "Introduction to Model Reduction; Sources of Large Models - Circuits, Electromagnetic Systems, Mechanical Systems; Discretization Methods - Finite Difference Method (FDM), Finite Element Method (FEM); Classical Model Reduction Methods - Pade Approximation, Moment matching, Routh Approximants; Modern Methods - Modal Model Reduction Methods, SVD (Grammian) based methods, Krylov based methods, SVD-Krylov based methods; MOR for Nonlinear Systems - SVD & POD Methods; Model Reduction in Control; Control Design on Reduced Models - Sub- optimal control; Sliding Mode Control as model reducing control - First Order SM, Higher Order Sliding Mode."
    },
    {
        "id": "ELL804 ",
        "name": "Robust Control",
        "credit": "(3-0-0)",
        "description": "Modeling of uncertain systems, Signals and Norms, Lyapunov theory for LTI systems  Passive systems - frequency domain, Passive systems - time domain, Robust Stability and performance, Stabilizing controllers - Coprime factorization, LQR, LQG problems Ricatti equations and solutions, H-infinity control and mu-synthesis, Linear matrix inequalities for robust control, Ricatti equation solution through LMI."
    },
    {
        "id": "ELL805",
        "name": "Networked and Multi-Agent Control Systems",
        "credit": "(3-0-0)",
        "description": "Overview of networked systems, Graph Theory Fundamentals, Graph- based Network Models, Network Optimization, Consensus Problem: cooperative control, leader-follower architecture. Control under Communication Constraints, Formation Control, Swarming and Flocking Collision Avoidance, Game Theoretic Control of Multi-Agent Systems, Applications: Multi-robot/vehicle coordination, Sensor Networks, Social Networks, Smart Grids, Biological Networks."
    },
    {
        "id": "ELL806 ",
        "name": "Modeling and Control of Distributed Parameter Systems ",
        "credit": "(3-0-0)",
        "description": "Overview of networked systems, Graph Theory Fundamentals, Graph- based Network Models, Network Optimization, Consensus Problem: cooperative control, leader-follower architecture. Control under Communication Constraints, Formation Control, Swarming and Flocking Collision Avoidance, Game Theoretic Control of Multi-Agent Systems, Applications: Multi-robot/vehicle coordination, Sensor Networks, Social Networks, Smart Grids, Biological Networks.  "
    },
    {
        "id": "ELL807 ",
        "name": "Stochastic Control ",
        "credit": "(3-0-0)",
        "description": "Overview of stochastic systems with examples, Modeling of Stochastic Systems: Continuous and discrete-time models subjected to noise, Markov Decision Processes, Introduction to Stochastic Calculus and Stochastic Differential Equations, Stochastic Stability, Stochastic Optimal Control with complete and partial observations, finite and infinite horizon problems, Linear and nonlinear Filtering, Separation Principle, Linear quadratic Gaussian Problem, Stochastic Dynamic Programming, Stochastic Adaptive Control, Applications: Finance, operations research, biology.  "
    },
    {
        "id": "ELL808",
        "name": "Advanced Topics in Systems and Control",
        "credit": "(3-0-0)",
        "description": "To be decided by the Instructor when floating this course: Can be anything that is related to systems and control engineering but is not covered in any of the established courses. "
    }
]